# Operations

### Basic

In [2]:
import pandas as pd

In [4]:
df1=pd.DataFrame({
    'A':[1,2,3,4,5],
    'B':[10,20,30,40,50],
    'C':[100,200,300,400,500]
})

df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [5]:
df1.shape

(5, 3)

In [6]:
df1.columns

Index(['A', 'B', 'C'], dtype='object')

In [7]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
dtypes: int64(3)
memory usage: 252.0 bytes

In [8]:
df1.describe()

              A          B           C
count  5.000000   5.000000    5.000000
mean   3.000000  30.000000  300.000000
std    1.581139  15.811388  158.113883
min    1.000000  10.000000  100.000000
25%    2.000000  20.000000  200.000000
50%    3.000000  30.000000  300.000000
75%    4.000000  40.000000  400.000000
max    5.000000  50.000000  500.000000

In [9]:
df1['A']+10

0    11
1    12
2    13
3    14
4    15
Name: A, dtype: int64

#### DataFrames applying fucntions

In [18]:
def square(x):
    return x**2


df1['B']=df1['B'].apply(square)
df1

,A,B,C,D
0,1,100000000000000000000000000000000,100,100000000000000000000000000000000
1,2,429496729600000000000000000000000000000000,200,429496729600000000000000000000000000000000
2,3,185302018885184100000000000000000000000000000000,300,185302018885184100000000000000000000000000000000
3,4,1844674407370955161600000000000000000000000000...,400,1844674407370955161600000000000000000000000000...
4,5,2328306436538696289062500000000000000000000000...,500,2328306436538696289062500000000000000000000000...

In [17]:
df1['D']=df1['B'].apply(lambda x:x**2)
df1

,A,B,C,D
0,1,10000000000000000,100,100000000000000000000000000000000
1,2,655360000000000000000,200,429496729600000000000000000000000000000000
2,3,430467210000000000000000,300,185302018885184100000000000000000000000000000000
3,4,42949672960000000000000000,400,1844674407370955161600000000000000000000000000...
4,5,1525878906250000000000000000,500,2328306436538696289062500000000000000000000000...